cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/core"

#  █████╗   ██████╗   ██████╗   ███████╗
# ██╔══██╗  ██╔══██╗  ██╔══██╗  ██╔════╝
# ███████║  ██████╔╝  ██████╔╝  ███████╗
# ██╔══██║  ██╔═══╝   ██╔═══╝   ╚════██║
# ██║  ██║  ██║       ██║       ███████║
# ╚═╝  ╚═╝  ╚═╝       ╚═╝       ╚══════╝

# Desktop apps in order of priority.

cask "typinator"            # (Typinator) Tool to automate the insertion of frequently used text and graphics
cask "rectangle"            # (Rectangle) Move and resize windows using keyboard shortcuts or snap areas
cask "visual-studio-code"   # (Visual Studio Code) Open-source code editor
cask "dropbox"              # (Dropbox) Client for the Dropbox cloud storage service
cask "iterm2"               # (iTerm 2) Terminal emulator as alternative to Apple's Terminal app
cask "google-chrome"        # (Google Chrome) Web browser
cask "descript"             # (Descript) Audio and video editor
cask "lulu"                 # (LuLu) Open-source firewall to block unknown outgoing connections
cask "hiddenbar"            # (Hidden Bar) Utility to hide menu bar items
cask "elgato-control-center"# (Elgato Control Center) Control your Elgato Key Lights
cask "elgato-stream-deck"   # (Elgato Stream Deck) Assign keys, and then decorate and label them
cask "adobe-creative-cloud" # (Adobe Creative Cloud) Collection of apps and services for photography, design, video, web, and UX
cask "notion"               # (Notion) App to write, plan, collaborate, and get organized
cask "whatsapp"             # (WhatsApp) Desktop client for WhatsApp
cask "audio-hijack"         # (Audio Hijack) Records audio from any application
cask "loopback"             # (Loopback) Cable-free audio router
cask "obs"                  # (OBS) Open-source software for live streaming and screen recording
cask "zoom"                 # (Zoom) Video communication and virtual meeting platform
cask "spotify"              # (Spotify) Music streaming service
cask "brave-browser"        # (Brave) Web browser focusing on privacy
cask "discord"              # (Discord) Voice and text chat software
cask "remarkable"           # (Remarkable) View, Screen Share, organize, import, and download files to a reMarkable device
cask "grammarly-desktop"    # (Grammarly Desktop) Grammarly for desktop
cask "vlc"                  # (VLC) Multimedia player
cask "fission"              # (Fission) Audio editor
cask "farrago"              # (Farrago) Audio playback
cask "netron"               # (Netron) Visualizer for neural network, deep learning, and machine learning models
cask "processing"           # (Processing) Flexible software sketchbook and a language for learning how to code
cask "calibre"              # (calibre) E-books management software
cask "slack"                # (Slack) Team communication and collaboration software
cask "docker"               # (Docker) Pack, ship and run any application as a lightweight container
cask "rode-central"         # (Rode Central) Configure RØDE device settings, features, functions, and firmware
cask "geekbench"            # (Geekbench) Tool to measure the computer system's performance
cask "qbittorrent"          # (qBittorrent) Peer to peer Bitorrent client
cask "raspberry-pi-imager"  # (Raspberry Pi Imager) Imaging utility to install operating systems to a microSD card"

cask "logitech-camera-settings" # (Logitech Camera Settings) Provides access to camera controls
cask "logi-options-plus"        # (Logitech Options+) Software for Logitech devices
cask "logitech-presentation"    # (Logitech Presentation) Presentation software

# Desktop apps I'm not actively using.

# cask "authy"                # (Authy Desktop) Two-factor authentication software
# cask "skype"              # (Skype) Video chat, voice call and instant messaging application
# cask "postman"            # (Postman) Collaboration platform for API development
# cask "forecast"           # (Forecast) Podcast MP3 encoder with chapters
# brew "handbrake"          # (HandBrake) Open-source video transcoder available for Linux, Mac, and Windows
# cask "grammarly"          # (Grammarly) Utility to fix grammar errors and style issues in text
# cask "freedom"            # (Freedom) App and website blocker
# cask "nordvpn"            # (NordVPN) VPN client for secure internet access and private browsing
# cask "inkscape"           # (Inkscape) Vector graphics editor
# cask "telegram"           # (Telegram for macOS) Messaging app with a focus on speed and security
# cask "mendeley"           # (Mendeley) Research management tool

# Removed

# cask "toggl-track"          # (Toggl Track) Time tracker
# cask "exodus"               # (Exodus) Desktop wallet for cryptocurrency assets

#  ██████╗  ██╗       ██╗
# ██╔════╝  ██║       ██║
# ██║       ██║       ██║
# ██║       ██║       ██║
# ╚██████╗  ███████╗  ██║
#  ╚═════╝  ╚══════╝  ╚═╝

# Command-line utilities.

brew "gnupg"            # GNU Pretty Good Privacy (PGP) package
brew "ssh-copy-id"      # Add a public key to a remote machine's authorized_keys file
brew "duti"             # Select default apps for documents and URL schemes on macOS
brew "go"               # Open source programming language to build simple/reliable/efficient software
brew "node"             # Platform built on V8 to build network applications
brew "deno"             # Secure runtime for JavaScript and TypeScript
brew "yarn"             # JavaScript package manager
brew "ffmpeg"           # Play, record, convert, and stream audio and video
brew "imagemagick"      # Tools and libraries to manipulate images in many formats
tap "eddieantonio/eddieantonio"
brew "imgcat"
tap "yt-dlp/taps"
brew "yt-dlp"           # Fork of youtube-dl with additional features and fixes
brew "asciinema"        # Record and share terminal sessions
brew "ack"              # Search tool like grep, but optimized for programmers
brew "glow"             # Render markdown on the CLI
brew "wget"             # Internet file retriever
brew "jq"               # Lightweight and flexible command-line JSON processor
brew "curl"             # Get a file from an HTTP, HTTPS or FTP server
cask "miniconda"        # (Continuum Analytics Miniconda) Minimal installer for conda
brew "jupyterlab"       # Interactive environments for writing and running code

brew "composer"         # Dependency Manager for PHP
brew "php"              # General-purpose scripting language
brew "dnsmasq"          # Lightweight DNS forwarder and DHCP server
brew "nginx"            # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "mysql"            # Open source relational database management system
brew "phpmyadmin"       # Web interface for MySQL and MariaDB

brew "xpdf"             # PDF viewer
brew "tree"             # Display directories as trees (with optional color/HTML output)
brew "rename"           # Perl-powered file rename script with many helpful built-ins
brew "figlet"           # Banner-like program prints strings as ASCII art

# brew "tesseract"        # OCR (Optical Character Recognition) engine
# brew "p7zip"            # 7-Zip (high compression file archiver) implementation
# cask "basictex"         # (BasicTeX) Compact TeX distribution as alternative to the full TeX Live / MacTeX
# brew "pandoc"           # Swiss-army knife of markup format conversion

# brew "mas"            # Mac App Store command-line interface
# brew "pngcheck"       # Print info and check PNG, JNG, and MNG files

# cask "google-cloud-sdk"   # (Google Cloud SDK) Set of tools to manage resources and applications hosted on Google Cloud
# cask "background-music"   # (Background Music) Audio utility

# cask "ngrok"            # (ngrok) Reverse proxy, secure introspectable tunnels to localhost
# brew "awscli"           # Official Amazon AWS command-line interface
# brew "mackup"           # Keep your Mac's application settings in sync
# brew "vault"            # Secures, stores, and tightly controls access to secrets
# brew tap aws/tap
# brew "aws-sam-cli"        # CLI tool to build, test, debug, and deploy Serverless applications using AWS Lambda

# No longer work.

# brew "dockutil"         # Tool for managing dock items

# ███████╗  ██████╗  ███╗   ██╗ ████████╗ ███████╗
# ██╔════╝ ██╔═══██╗ ████╗  ██║ ╚══██╔══╝ ██╔════╝
# █████╗   ██║   ██║ ██╔██╗ ██║    ██║    ███████╗
# ██╔══╝   ██║   ██║ ██║╚██╗██║    ██║    ╚════██║
# ██║      ╚██████╔╝ ██║ ╚████║    ██║    ███████║
# ╚═╝       ╚═════╝  ╚═╝  ╚═══╝    ╚═╝    ╚══════╝

# Fonts.

brew tap homebrew/cask-fonts
brew "font-inter"
brew "font-ibm-plex-mono"
brew "font-ibm-plex-sans"
brew "font-ibm-plex-serif"