cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/core"

# High priority
cask "rectangle"
cask "typinator"
cask "visual-studio-code"
cask "toggl-track"
cask "notion"
cask "whatsapp"
cask "obs"
cask "lulu"
tap "homebrew/cask-drivers"
cask "logitech-camera-settings"
cask "spotify"
cask "hiddenbar"

# Failed because they were manually installed
# cask "google-chrome"
# cask "dropbox"
# cask "audio-hijack"
# cask "loopback"
# cask "zoom"

# Open source programming language to build simple/reliable/efficient software
brew "go"
# Search tool like grep, but optimized for programmers
brew "ack"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# Download YouTube videos from the command-line
tap "yt-dlp/taps"
brew "yt-dlp"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
brew "asciinema"
# brew "asciicast2gif" # Not available on brew
brew "awscli"
brew "glow"
brew "dockutil"
brew "wget"
brew "ssh-copy-id"
brew "mackup"
brew "imagemagick"
# Development
brew "jq"
brew "vault"
brew "curl"
brew "jupyterlab"
# Web development
brew "composer"
brew "php"
brew "dnsmasq"
brew "nginx"
brew "mysql"
brew "phpmyadmin"
# Tools
brew "tesseract"
# brew "pandoc"
# Mac App Store command-line interface
# brew "mas"
brew "xpdf"
brew "tree"
brew "rename"
brew "figlet"
# brew "swift" # comes with Xcode
# brew "pngcheck"
brew "figlet"
brew "p7zip"

# Minimal Conda installer specific to conda-forge comparable to Miniconda
cask "anaconda"
cask "authy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "discord"
cask "remarkable"
cask "vlc"
cask "grammarly"
cask "fission"
cask "farrago"
cask "handbrake"
cask "freedom"
cask "nordvpn"
cask "docker"
cask "ngrok"
cask "netron"
cask "basictex"
#cask "calibre"
cask "postman"
cask "forecast"
cask "processing"

# cask "inkscape"
# cask "background-music"
# cask "calibre"
# cask "google-cloud-sdk"
# cask "postman"
# cask "slack"
# cask "skype"
# cask "brave-browser"
# cask "telegram"

# Manual downloads
# https://www.descript.com/download/mac
# cask "adobe-creative-cloud"
# https://creativecloud.adobe.com/apps/all/desktop?action=install&source=apps&productId=creative-cloud
